#حانیه شاپوری

#ایجاد لیست و تعیین عددی که باید حذف شود
list = [1, 2, 3, 4, 2, 5, 2, 6]
item_remove = 2

#استفاده از متغیر های len و new_len برای ذخیره‌ی اطلاعات مربوط به طول اولیه لیست و طول جدید لیست 
#سپس محاسبه تعداد آیتم های تعیین شده حذفی
initial_len = len(list)
new_len = initial_len
item_count = list.count(item_remove)

#تعریف یک حلقه while که تا زمانی که طول اولیه لیست و طول جدید با هم برابر نبودند حلقه ادامه پیدا کرده و حذف صورت گیرد
#در نهایت طول جدید لیست محاسبه و در new_len ذخیره می‌شود
while len(list) != new_len:
    list.remove(item_remove)
    new_len = len(list)

#چاپ نتیجه نهایی یک بار برای تعداد عناصر حذف شده و یک بار برای لیست نهایی 
print(f"تعداد {item_remove} های حذف شده: {item_count}")
print("لیست نهایی:", list)
